Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Next, prepare your `application.properties` configuration file. You can start with an empty `application.properties` file because `Dev Services for Keycloak` registers `quarkus.oidc.auth-server-url` and points it to the running test container, `quarkus.oidc.client-id=quarkus-app`, and `quarkus.oidc.credentials.secret=secret`.
ja_jp: 次に、 `application.properties` 設定ファイルを準備します。 空の `application.properties` ファイルから開始できます。 `Dev Services for Keycloak` が `quarkus.oidc.auth-server-url` を登録し、その参照先として実行中のテストコンテナー、 `quarkus.oidc.client-id=quarkus-app`、および `quarkus.oidc.credentials.secret=secret` を設定するためです。

source: Next, produce a `AssistantConsoleBuildItem` in a `@BuildStep`:
ja_jp: 次に、 `@BuildStep` で `AssistantConsoleBuildItem` を作成します。

source: Next, provide the JWT bearer token as a `client_assertion` parameter to the OIDC client.
ja_jp: 次に、JWT ベアラートークンを `client_assertion` パラメーターとして OIDC クライアントに提供します。

source: Next, re-enter the tools container if you exited, and inspect the native executable with `objdump`, and see how the symbols are now present:
ja_jp: 次に、終了した場合はツールコンテナーに再度入り、 `objdump` を使用してネイティブ実行可能ファイルを検査し、シンボルがどのように存在するようになったかを確認します。

source: Next, save this SAML integration and note its Metadata URL:
ja_jp: 次に、この SAML インテグレーションを保存し、その Metadata URL をメモします。

source: Next, start Neo4j in a container:
ja_jp: 次に、Neo4jをコンテナで起動します。

source: Next, test that the programmatically created OIDC client correctly acquires and propagates the token with `RestClientWithTokenHeaderParam` both in reactive and imperative (blocking) modes.
ja_jp: 次に、プログラムで作成された OIDC クライアントが、リアクティブモードと命令型 (ブロッキング) モードの両方で、 `RestClientWithTokenHeaderParam` を使用してトークンを正しく取得して伝播することをテストします。

source: Next, test the endpoints which use OIDC client in in the blocking mode.
ja_jp: 次に、ブロッキングモードで OIDC クライアントを使用するエンドポイントをテストします。

source: Next, test the service by entering a relative service path and sending a token. SPA usually sends access tokens to the application endpoint, so choose the *With Access Token* option, for example:
ja_jp: 次に、相対サービスパスを入力し、トークンを送信してサービスをテストします。 SPAは通常、アプリケーションのエンドポイントにアクセストークンを送信するので、たとえば *With Access Token* オプションを選択します。

source: Next, the JWT bearer token must be provided as a `client_assertion` parameter to the OIDC client.
ja_jp: 次に、JWT ベアラートークンを `client_assertion` パラメーターとして OIDC クライアントに提供する必要があります。

source: Next, this JSON is URL-encoded and added as an `authorization_details` query parameter to the authorization code flow redirect URL.
ja_jp: 次に、この JSON は URL エンコードされ、`authorization_details` クエリーパラメーターとして認可コードフローリダイレクト URL に追加されます。

source: Next, try to access http://localhost:8080/crash:
ja_jp: 次に、 http://localhost:8080/crash へのアクセスを試みます。

source: Next, update the Quarkus endpoint to require that only users with the `admin` role can access the endpoint:
ja_jp: 次に、Quarkus エンドポイントを更新して、 `admin` ロールを持つユーザーのみがエンドポイントにアクセスできるようにします。

source: Next, use the following command to generate the JWT:
ja_jp: 次に、次のコマンドを使用して JWT を生成します。

source: Next, we add the Quarkus Chicory extension to our pom.xml:
ja_jp: 次に、Quarkus Chicory エクステンションを pom.xml に追加します。

source: Next, we can set a query param `namedQuery` when listing the entities using the generated resource with the name of the named query that we want to use, for example, calling `http://localhost:8080/people?namedQuery=Person.containsInName&name=ter` would return all the persons which name contains the text "ter".
ja_jp: 次に、使用したい名前付きクエリの名前で生成されたリソースを使用してエンティティを一覧表示するときに、クエリ パラメータ `namedQuery` を設定できます。 `http://localhost:8080/people?namedQuery=Person.containsInName&name=ter` の呼出は、名前に "ter"という文字列が含まれる人物をすべて返します。

source: Next, we create a rule file `loan-rules.drl` inside the `src/main/resources/org/acme/kogito/queries` folder of the generated project.
ja_jp: 次に、生成されたプロジェクトの `src/main/resources/org/acme/kogito/queries` フォルダ内にルールファイル `loan-rules.drl` を作成します。

source: Next, we create a rule file `person-rules.drl` inside the `src/main/resources/org/acme/kogito` folder of the generated project.
ja_jp: 次に、生成されたプロジェクトの `src/main/resources/org/acme/kogito` フォルダー内にルールファイル `person-rules.drl` を作成します。

source: Next, we create a rule file `rules.drl` inside the `src/main/resources/org/drools/quarkus/quickstart/test` folder of the Quarkus project.
ja_jp: 次に、Quarkus プロジェクトの `src/main/resources/org/drools/quarkus/quickstart/test` フォルダー内にルールファイル `rules.drl` を作成します。

source: Next, we have an implementation example. The class contains a `MAP_SETTER`, a `MAP_GETTER` and 2 methods.
ja_jp: 次に、実装例を示します。このクラスには、`MAP_SETTER`、`MAP_GETTER`、および 2 つのメソッドが含まれています。

source: Next, we need to adapt the `FruitMapper` to construct a `ReactiveFruitDao` instance:
ja_jp: 次に、 `FruitMapper` を適応させて、 `ReactiveFruitDao` インスタンスを構築する必要があります。

source: Next, we need to create an instance of `WebClient`. Extend the `VertxResource` class with the `client` field and the creation of the web client in the constructor:
ja_jp: 次に、 `WebClient` のインスタンスを作成する必要があります。 `client` フィールドとウェブクライアントの作成をコンストラクタに追加して、 `VertxResource` クラスを拡張します：

source: Next, we need to deploy our Quarkus application into OpenShift. For ease this step, Quarkus provides a super useful extension called `quarkus-openshift`, let's add it into our `pom.xml` file:
ja_jp: 次に、QuarkusアプリケーションをOpenShiftにデプロイする必要があります。このステップを簡単にするために、Quarkusは `quarkus-openshift` という非常に便利なエクステンションを提供していますので、これを `pom.xml` ファイルに追加しましょう。

source: Next, we need to update the functional test to reflect the changes made to the endpoint. Edit the `src/test/java/org/acme/rest/client/ExtensionsResourceTest.java` file and change the content of the test to:
ja_jp: 次に、エンドポイントに加えられた変更を反映させるために、機能テストを更新する必要があります。 `src/test/java/org/acme/rest/client/ExtensionsResourceTest.java` ファイルを編集し、テストの内容を以下のように変更します。

source: Next, we want to expose our application using the Kubernetes Ingress resource:
ja_jp: 次に、Kubernetes Ingress リソースを使用してアプリケーションを公開します。

source: Next, while being in https://github.com/vert-x3/vertx-redis-client[`vertx-redis-client`] root folder execute:
ja_jp: 次に、link:https://github.com/vert-x3/vertx-redis-client[`vertx-redis-client`] ルートフォルダにいる状態で 次を実行します:

source: Next, while still in the Auth0 dashboard, add some users to your application.
ja_jp: 次に、そのまま Auth0 ダッシュボードでアプリケーションにユーザーを追加します。

source: Next, write the test code as follows:
ja_jp: 次に、以下のようにテストコードを記述します。

source: Next, you can register your filter using the `@RegisterProvider` annotation:
ja_jp: 次に、 `@RegisterProvider` アノテーションを使用してフィルターを登録できます。

source: Next, you need to create the keyspace and table that will be used by your application. If you are using Docker, run the following commands:
ja_jp: 次に、アプリケーションで使用するキースペースとテーブルを作成する必要があります。Docker を使用している場合は、次のコマンドを実行してください。

source: Next, you need to download the **Key file** (which serves as **private key**) of the service account and note the **issuer URL** (typically `https://auth.streamnative.cloud/`) and the **audience** (for example `urn:sn:pulsar:o-rf3ol:redhat`) for your cluster. The **Pulsar Clients** page in the **Admin** section in the StreamNative Cloud console helps you with this process.
ja_jp: 次に、サービスアカウントの **キーファイル** (**秘密鍵** として機能します) をダウンロードし、**発行者 URL** (通常は `https://auth.streamnative.cloud/`) とクラスターの **オーディエンス** (`urn:sn:pulsar:o-rf3ol:redhat` など) をメモする必要があります。 この手順を行う際には、StreamNative Cloud コンソールの **Admin** セクションにある **Pulsar Clients** ページが役立ちます。

source: Next, you will learn how to migrate the Vert.x application to Quarkus, while `completely retaining` the Vert.x OIDC code.
ja_jp: 次に、Vert.x OIDC のコードを `完全に保持` したまま、Vert.x アプリケーションを Quarkus に移行する方法を学びます。

source: Next, you'll need one interceptor for each of those annotations:
ja_jp: 次に、これらのアノテーションごとに 1 つのインターセプターが必要になります。

source: Nexus Repository Manager: Add Proxy Repository
ja_jp: Nexus リポジトリマネージャ: プロキシリポジトリの追加

source: Nice. How does the dependency resolution work? I see no names or identifiers.
ja_jp: いいですね。依存関係の解決方法はどのように動作しますか?名前も識別子も見当たりません。

source: No
ja_jp: 不可

source: No <<value-resolvers,``ValueResolver``s>> are generated automatically.
ja_jp: <<value-resolvers,``ValueResolver``s>> は自動生成されません。

source: No Need for `Application` Class
ja_jp: `Application` クラスは不要

source: No Streaming API for JDK 17
ja_jp: JDK 17 のストリーミング API なし

source: No `TemplateInstance.Initializer` is registered by default, therefore <<global_variables,`@TemplateGlobal`>> annotations are ignored.
ja_jp: デフォルトで `TemplateInstance.Initializer` は登録されていないため、<<global_variables,`@TemplateGlobal`>> アノテーションは無視されます。

source: No `quarkus.stork.my-service.service-registrar.type` is needed because there's only one registrar configuration in `application.properties`.
ja_jp: `application.properties` 内にレジストラ設定が 1 つしかない場合、 `quarkus.stork.my-service.service-registrar.type` は不要です。

source: No action is needed for users.
ja_jp: ユーザー側で必要なアクションはありません。

source: No added attributes, this time.
ja_jp: 今回は属性は追加されません。

source: No additional configuration needs to be applied for this secure serialization to take place. However, users can use the `@io.quarkus.resteasy.reactive.jackson.EnableSecureSerialization` and `@io.quarkus.resteasy.reactive.jackson.DisableSecureSerialization` annotation to opt in or out for specific JAX-RS Resource classes or methods.
ja_jp: この安全なシリアル化を実行するために、追加の設定を適用する必要はありません。ただし、ユーザーは `@io.quarkus.resteasy.reactive.jackson.EnableSecureSerialization` と `@io.quarkus.resteasy.reactive.jackson.DisableSecureSerialization` アノテーションを使って、特定の JAX-RS Resource クラスまたはメソッドを選択することも可能です。

source: No additional configuration needs to be applied for this secure serialization to take place. However, users can use the `@io.quarkus.resteasy.reactive.jackson.EnableSecureSerialization` and `@io.quarkus.resteasy.reactive.jackson.DisableSecureSerialization` annotation to opt in or out for specific Jakarta REST Resource classes or methods.
ja_jp: この安全なシリアライズを行うために、追加の設定を適用する必要はありません。ただし、ユーザーは `@io.quarkus.resteasy.reactive.jackson.EnableSecureSerialization` および `@io.quarkus.resteasy.reactive.jackson.DisableSecureSerialization` アノテーションを使用して、特定の Jakarta REST Resource クラスまたはメソッドに対するオプトインまたはオプトアウトを行うことができます。

source: No additional configuration needs to be applied for this secure serialization to take place. However, users can use the `@io.quarkus.resteasy.reactive.jackson.EnableSecureSerialization` and `@io.quarkus.resteasy.reactive.jackson.DisableSecureSerialization` annotation to opt-in or out for specific JAX-RS Resource classes or methods.
ja_jp: この安全なシリアル化を実行するために、追加の設定を適用する必要はありません。ただし、ユーザーは `@io.quarkus.resteasy.reactive.jackson.EnableSecureSerialization`と`@io.quarkus.resteasy.reactive.jackson.DisableSecureSerialization` アノテーションを使って、特定の JAX-RS Resource クラスまたはメソッドを選択することも可能です。

source: No authorization header is present, therefore the Test Security Extension creates user `Bob`.
ja_jp: 認証ヘッダーが存在しないため、テストセキュリティーエクステンションによってユーザー Bob が作成されます。

source: No configuration is required, though the possible configuration options are described below.
ja_jp: 設定は必要ありませんが、可能な設定オプションについては以下で説明します。

source: No configuration properties required. The `Defaults.foo()` will return the value `foo` and `Defaults.bar()` will return the value `bar`.
ja_jp: 設定プロパティは必要ありません。 `Defaults.foo()` は値 `foo` を、 `Defaults.bar()` は値 `bar` を返します。

source: No configuration properties required. The `Defaults.foo()` will return the value `foo` and `Defaults.bar()` will return thevalue `bar`.
ja_jp: 設定プロパティは必要ありません。 `Defaults.foo()` は値 `foo` を、 `Defaults.bar()` は値 `bar` を返します。

source: No configuration required at all:
ja_jp: 設定は一切不要です。

source: No data produced
ja_jp: データが生成されていません

source: No data was found for the given weather station id
ja_jp: 指定された weather station id に対するデータが見つからなかった

source: No direct replacement
ja_jp: 直接交換不可

source: No equivalent annotation in JAX-RS. Exceptions are handled by implementing `javax.ws.rs.ext.ExceptionMapper`
ja_jp: JAX-RSには同等のアノテーションはありません。例外は、 `javax.ws.rs.ext.ExceptionMapper` の実装によってハンドリングされます。

source: No equivalent annotation in Jakarta REST. Exceptions are handled by implementing `jakarta.ws.rs.ext.ExceptionMapper`
ja_jp: Jakarta RESTには同等のアノテーションはありません。例外の処理には `jakarta.ws.rs.ext.ExceptionMapper` の実装によってハンドリングされます。

source: No equivalent in JAX-RS
ja_jp: JAX-RSには同等のものはありません。

source: No equivalent in JAX-RS. Method parameters corresponding to the body of the request are handled in JAX-RS without requiring any annotation
ja_jp: JAX-RSでは同等のものはありません。JAX-RSでは、リクエストのボディに対応するメソッドのパラメータは、アノテーションを必要とせずに処理されます

source: No equivalent in Jakarta REST
ja_jp: Jakarta RESTに同等のものはありません。

source: No equivalent in Jakarta REST. Method parameters corresponding to the body of the request are handled in Jakarta REST without requiring any annotation
ja_jp: Jakarta RESTに同等のものはありません。リクエスト本体に対応するメソッドパラメータは、Jakarta RESTではアノテーションを必要とせずハンドリングされます。

source: No extra Maven configuration is needed.
ja_jp: 追加の Maven 設定は必要ありません。

source: No further action will be taken, and the tests will continue as normal (generally until CI times out), however the printed stack traces should help diagnose why the build has failed. You can control this timeout with the `quarkus.test.hang-detection-timeout` system property (you can also set this in application.properties, but this won't be read until Quarkus has started, so the timeout for Quarkus start will be the default of 10 minutes).
ja_jp: これ以上のアクションは実行されず、テストは通常どおり (通常は CI がタイムアウトするまで) 続行されますが、出力されたスタックトレースは、ビルドが失敗した理由を診断するのに役立ちます。このタイムアウトは、 `quarkus.test.hang-detection-timeout` システムプロパティーで制御できます (これは application.properties でも設定できますが、Quarkus が起動するまで読み取られないため、Quarkus の起動タイムアウトはデフォルトの 10 分です)。

source: No guide yet
ja_jp: ガイドはまだありません

source: No hassle native executable generation
ja_jp: 容易なネイティブ実行可能ファイル生成

source: No legumes there.
ja_jp: そこにはマメ科類はありません。

source: No more bloated dependencies
ja_jp: 肥大化した依存関係が解消されました

source: No more reflection to scan "beans" to help configuration or DI
ja_jp: 設定やDIのための"Bean"をスキャンするためのリフレクションがなくなりました

source: No need to configure anything, as Quarkus will automatically associate the `quotes` channel to the `quotes` Kafka topic. It will also generate a deserializer for the `Quote` class.
ja_jp: Quarkus は `quotes` チャネルを `quotes` Kafka トピックに自動的に関連付けるため、何も設定する必要はありません。また、 `Quote` クラスのデシリアライザーも生成します。

source: No need to configure anything, as Quarkus will automatically associate the `quotes` channel to the `quotes` Pulsar topic. It will also generate a deserializer for the `Quote` class.
ja_jp: Quarkus は `quotes` チャネルを `quotes` Pulsar トピックに自動的に関連付けるため、何も設定する必要はありません。また、 `Quote` クラスのデシリアライザーも生成します。

source: No need to depend on Vert.x Web directly, it's included.
ja_jp: Vert.x Webに直接依存する必要はなく、含まれています。

source: No need to start a Kafka broker when using the dev mode or for tests. Quarkus starts a broker for you automatically. See xref:kafka-dev-services.adoc[Dev Services for Kafka] for details.
ja_jp: 開発モードを使用するとき、またはテストのために、Kafka ブローカーを起動する必要はありません。Quarkus が自動的にブローカーを開始します。詳細については、xref:kafka-dev-services.adoc[Dev Services for Kafka] を参照してください。

source: No need to start a Pulsar broker when using the dev mode or for tests. Quarkus starts a broker for you automatically. See xref:pulsar-dev-services.adoc[Dev Services for Pulsar] for details.
ja_jp: 開発モードを使用するとき、またはテストのために、Pulsar ブローカーを起動する必要はありません。Quarkus が自動的にブローカーを開始します。詳細については、xref:pulsar-dev-services.adoc[Dev Services for Pulsar] を参照してください。

source: No old object sampling
ja_jp: oldオブジェクトのサンプリングはありません

source: No output appears when querying the symbol table. This is why we don't see any call graphs in the flame graphs. This is a deliberate decision that native-image makes. By default, it removes symbols from the binary.
ja_jp: シンボルテーブルをクエリーすると、出力は表示されません。これが、フレームグラフにコールグラフが表示されない理由です。これは、ネイティブイメージが行う意図的な決定です。デフォルトでは、バイナリーからシンボルを削除します。

source: No problem. You can generate the bytecode of a bean class manually and then all you need to do is to produce a `GeneratedBeanBuildItem` instead of `GeneratedClassBuildItem`.
ja_jp: 問題ありません。Bean クラスのバイトコードを手動で生成し、その後に `GeneratedClassBuildItem` ではなく `GeneratedBeanBuildItem` を生成してください。

source: No problem. You can generate the bytecode of a bean class manually, and then all you need to do is to produce a `GeneratedBeanBuildItem` instead of `GeneratedClassBuildItem`.
ja_jp: 問題ありません。 Bean クラスのバイトコードを手動で生成し、その後に `GeneratedClassBuildItem` ではなく `GeneratedBeanBuildItem` を生成してください。

source: No replacement, natively supports Mutiny
ja_jp: 代替ではなく、Mutiny をネイティブにサポートしています

source: No section helpers are registered by default.
ja_jp: デフォルトでは、セクションヘルパーは登録されていません。

source: No special action needs to be taken when running the native binary in a container. If the native binary was properly built with the custom TrustStore as described in the previous section, it will work properly in container as well.
ja_jp: コンテナー内でネイティブバイナリーを実行する際に特別な対応を取る必要はありません。前のセクションで説明したように、ネイティブバイナリーがカスタムTrustStoreを使って適切にビルドされていれば、コンテナー内でも正常に動作します。

source: No stacktrace tracing
ja_jp: スタックトレースのトレースがありません

source: No user-defined tags are registered automatically.
ja_jp: ユーザー定義のタグは自動的に登録されません。

source: No value was found, either because a non-existing station was queried or no measurement exists yet for the given station
ja_jp: 存在しないステーションが照会されたか、指定されたステーションの測定値がまだ存在しないかのどちらかで、値が見つかりませんでした

source: No xref:value-resolvers[``ValueResolver``s] are generated automatically.
ja_jp: xref:value-resolvers[ValueResolver] が自動生成されることはありません。

source: No, really, it is not. You can develop your own extensions very easily and they can solve some out of the ordinary problems in a very simple way.
ja_jp: いいえ、そんなことはありません。独自のエクステンションを簡単に開発することができ、通常では考えられないような問題を非常にシンプルな方法で解決することができます。

source: No, this is an old folk tale. Let's assume it essentially comes for free and let you scale to more complex cases involving several datasources as needed.
ja_jp: いや、これは昔話です。基本的にはフリーで提供され、必要に応じて複数のデータソースを含むより複雑なケースにも対応できると考えてください。

source: Node-level: `node.pool.open-connections`.
ja_jp: ノードレベル: `node.pool.open-connections`。

source: Node.js has great tooling to create modern frontend web applications. Quarkus has a broad ecosystem to build reliable modern backends in the cloud (microservices, rest, DBs, events, cloud native…). Quinoa is the glue to get the best of both worlds.
ja_jp: Node.jsには、モダンなフロントエンドのWebアプリケーションを作成するための優れたツールがあります。Quarkusには、クラウドで信頼性の高いモダンなバックエンドを構築するための幅広いエコシステムがあります（マイクロサービス、レスト、DB、イベント、クラウド・ネイティブ...）。Quinoaは、この2つの世界の長所を得るための接着剤です。

source: Non Application Root Path Considerations
ja_jp: アプリケーション以外のルートパスに関する考慮事項

source: Non Application endpoints
ja_jp: 非アプリケーションエンドポイント

source: Non application endpoints moved to `/q/`
ja_jp: アプリケーション以外のエンドポイントは `/q/` に移動しました。

source: Non blocking
ja_jp: ノンブロッキング

source: Non-S2I Builds
ja_jp: 非S2Iビルド

source: Non-S2I builds
ja_jp: 非S2Iビルド

source: Non-application endpoint support shipped in `1.11.0.Final`.
ja_jp: アプリケーション以外のエンドポイントのサポートは `1.11.0.Final` で出荷されました。

source: Non-application root path considerations
ja_jp: アプリケーション以外のルートパスに関する考慮事項

source: Non-blocking Methods
ja_jp: ノンブロッキング方式

source: Non-blocking by default
ja_jp: デフォルトでノンブロッキング

source: Non-blocking internals
ja_jp: 非ブロッキング内部

source: Non-blocking methods must execute on the connection's event loop thread.
ja_jp: ノンブロッキングメソッドは、接続のイベントループスレッドで実行する必要があります。

source: Non-compatible mode is enabled by default, so methods that return `CompletionStage` (or `Uni`) have asynchronous fault tolerance applied without any `@Asynchronous`, `@Blocking` or `@NonBlocking` annotation.
ja_jp: 非互換モードはデフォルトで有効なので、 `CompletionStage` (または `Uni` ) を返すメソッドには、 `@Asynchronous` , `@Blocking` , `@NonBlocking` のアノテーションがなくても非同期フォールトトレランスが適用されます。

source: Non-compatible mode is enabled by default. This means that methods that return `CompletionStage` (or `Uni`) have asynchronous fault tolerance applied without any `@Asynchronous`, `@AsynchronousNonBlocking`, `@Blocking` or `@NonBlocking` annotation. It also means that circuit breaker, fallback and retry automatically inspect the exception cause chain if the exception itself is insufficient to decide what should happen.
ja_jp: 非互換モードはデフォルトで有効になっています。 これは、 `CompletionStage` (または `Uni` ) を返すメソッドには、 `@Asynchronous` 、 `@AsynchronousNonBlocking` 、 `@Blocking` 、 `@NonBlocking` のアノテーションがなくても、非同期フォールトトレランスが適用されることを意味します。 また、サーキット・ブレーカー、フォールバック、リトライは、例外そのものが何が起こるべきかを決定するのに不十分な場合、例外の原因チェーンを自動的に検査することを意味します。

source: Non-compatible mode is enabled by default. This means that methods that return `CompletionStage` (or `Uni`) have asynchronous fault tolerance applied without any `@Asynchronous`, `@Blocking` or `@NonBlocking` annotation. It also means that circuit breaker, fallback and retry automatically inspect the exception cause chain if the exception itself is insufficient to decide what should happen.
ja_jp: 非互換モードはデフォルトで有効になっています。 これは、 `CompletionStage` (または `Uni`) を返すメソッドには、 `@Asynchronous`, `@Blocking`, `@NonBlocking` アノテーションなしで、非同期のフォールトトレランスが適用されることを意味します。 また、サーキットブレーカー、フォールバック、リトライは、例外そのものがどうなるべきかを判断するのに不十分な場合、例外の原因チェーンを自動的に検査することを意味します。

source: Non-compatible mode is enabled by default. This means that methods that return `CompletionStage` (or `Uni`) have asynchronous fault tolerance applied without the `@Asynchronous` or `@AsynchronousNonBlocking` annotation. It also means that circuit breaker, fallback and retry automatically inspect the exception cause chain if the exception itself is insufficient to decide what should happen.
ja_jp: 非互換モードはデフォルトで有効に指定されています。 この設定では、`CompletionStage` (または `Uni`) を返すメソッドに、`@Asynchronous` または `@AsynchronousNonBlocking` アノテーションなしで非同期フォールトトレランスが適用されます。 また、例外自体が何が起こるかを決定するのに不十分な場合、サーキットブレーカー、フォールバック、再試行によって例外原因チェーンが自動的に検査されることになります。

source: Non-existing classes and resources
ja_jp: 存在しないクラスとリソース

source: Non-file attributes added directly to `ClientMultipartForm` if not `FileItem`.
ja_jp: `FileItem` でない場合は、ファイル以外の属性が `ClientMultipartForm` に直接追加されます。

source: Non-intercepted method invoking another method from the same bean that has associated binding(s); this will trigger interception.
ja_jp: インターセプトされないメソッドが、関連付けられたバインディングを持つ同じ Bean から別のメソッドを呼び出します。これにより、インターセプトがトリガーされます。

source: Non-public members, constructors, static initializers, static, synthetic and void methods are always ignored.
ja_jp: 非publicのメンバー、コンストラクタ、静的イニシャライザ、静的メソッド、合成メソッド、ボイドメソッドは常に無視されます。

source: Non-scoped class will default to Application Scope
ja_jp: スコープ指定されていないクラスは、デフォルトでアプリケーションスコープになります。

source: Non-standard Features
ja_jp: 標準外の機能

source: Non-type-safe queries
ja_jp: タイプセーフでないクエリ

source: None
ja_jp: なし

source: None of the above: this is where Chicory, a WebAssembly runtime for Java, comes to help.
ja_jp: そのどちらでもありません。ここで、Java 用の WebAssembly ランタイムである Chicory が役に立ちます。

source: Nonetheless, setting this property is encouraged even if the endpoint does not require access to the remote introspection endpoint. The reasons behind it that `client-id`, if set, can be used to verify the token audience and will also be included in the logs when the token verification fails for the better traceability of the tokens issued to specific clients to be analyzed over a longer period of time.
ja_jp: それでも、エンドポイントがリモートイントロスペクションエンドポイントへのアクセスを必要としない場合でも、このプロパティーを設定することをお勧めします。その背後にある理由は、 `client-id` が設定されている場合、トークンオーディエンスを検証するために使用でき、トークンの検証が失敗したときにログに含まれるため、長い期間分析対象となる特定のクライアントに発行されたトークンのトレーサビリティが向上するためです。

source: Nonetheless, setting this property is encouraged even if the endpoint does not require an access to the remote introspection endpoint. The reasons behind it that `client-id`, if set, can be used to verify the token audience and will also be included in the logs when the token verification fails for the better traceability of the tokens issued to specific clients to be analyzed over a longer period of time.
ja_jp: それでも、エンドポイントがリモートイントロスペクションエンドポイントへのアクセスを必要としない場合でも、このプロパティーを設定することをお勧めします。その背後にある理由は、 `client-id` が設定されている場合、トークンオーディエンスを検証するために使用でき、トークンの検証が失敗したときにログに含まれるため、長い期間分析対象となる特定のクライアントに発行されたトークンのトレーサビリティが向上するためです。

source: Normal-ness
ja_jp: 標準性
